<!-- dflook/terraform-github-actions {"workspace":"default","backend":"35aa82d0e545654f0f1d1bb07d913eaf473fcd01c325030297528a60cad80df5","backend_type":"s3","plan_job_ref":"Job Terraform CI #4 at https://github.com/dannylongeuay/cluster-management/actions/runs/3095216575","plan_hash":"49b228c5cae4168f4904b16667b5d5c7718f55a6688319c04aa6b523babbdd84","plan_text_format":"text"} -->
Terraform plan in __terraform/ndsquared-prod-sf03__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_certificate.ndsq_domain_cert will be created
  + resource "digitalocean_certificate" "ndsq_domain_cert" {
      + domains          = [
          + "ndsquared.net",
        ]
      + id               = (known after apply)
      + name             = "ndsq-domain-cert"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
      + uuid             = (known after apply)
    }

  # digitalocean_spaces_bucket.ndsq_content will be updated in-place
  ~ resource "digitalocean_spaces_bucket" "ndsq_content" {
      + acl                = "public-read"
      + force_destroy      = false
        id                 = "ndsq-content"
        name               = "ndsq-content"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # digitalocean_spaces_bucket.tfstate will be updated in-place
  ~ resource "digitalocean_spaces_bucket" "tfstate" {
      + acl                = "private"
      + force_destroy      = false
        id                 = "ndsq-terraform-state"
        name               = "ndsq-terraform-state"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform CI #4](https://github.com/dannylongeuay/cluster-management/actions/runs/3095216575)